kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Station-V_7_5_3/ESP32-S3-Station-V_7_5_3.ino
/**
 * ============================================================================
 * โครงการวิจัย: ผลของการใช้นวัตกรรม Smart IV Alert ต่อความแม่นยำในการแจ้งเตือนและปริมาณสารน้ำที่ได้รับ
 * หน่วยงาน: หอผู้ป่วยอายุรกรรม โรงพยาบาลสูงเม่น อำเภอสูงเม่น จังหวัดแพร่
 * สถาบัน: วิทยาลัยพยาบาลบรมราชชนนี แพร่ คณะพยาบาลศาสตร์ สถาบันพระบรมราชชนก
 *
 * ระบบ: Bed Station Node (เครื่องตรวจวัดและแจ้งเตือนประจำเตียง)
 * เวอร์ชัน: 7.5.3 (Protocol v3 — ใช้คู่กับ Central Host Firmware 4.6.0 / 4.7.0)
 * บอร์ดประมวลผล: ESP32-S3 Super Mini + จอสี TFT 1.47" (ST7789 SPI 172x320) + Passive Buzzer
 *
 * ---------------------------------------------------------------------------
 * เปลี่ยนใน V7.5.3: แก้อาการ "Host ขึ้น OFFLINE ทั้งที่ Station ยังออนไลน์"
 *   อาการนี้เกิดเมื่อมีหลายเตียงพร้อมกัน และสาเหตุอยู่ที่ "จังหวะส่ง" ไม่ใช่สัญญาณอ่อน
 *
 *   ของเดิมทุกสเตชันส่งข้อมูลทุก 1000 ms เป๊ะ ไม่มีการสุ่มเลย คริสตัลของบอร์ดสองตัว
 *   ต่างกันราว 40 ppm = คาบส่งเลื่อนหากันเพียง 0.04 ms ต่อวินาที เมื่อใดที่สองเตียง
 *   ส่งห่างกันไม่ถึงความยาวเฟรม (~0.8 ms) มันจะชนกันแบบนั้น "ค้างอยู่ราว 40 วินาที"
 *   กว่าจะเลื่อนพ้นกัน ระหว่างนั้น Host ไม่ได้รับของเตียงนั้นเลยจึงขึ้น OFFLINE
 *
 *   ทำไม Station ถึงยังขึ้นว่าออนไลน์ตลอด — เพราะ Host ส่ง Sync เตียงละใบ
 *   มีกี่เตียงก็ส่งเท่านั้นใบต่อวินาที และ Station รับทุกใบไม่ว่าจะจ่าหน้าถึงเตียงใด
 *   ฝั่ง Station จึงมีข้อมูลสำรองมากกว่าฝั่ง Host ถึง N เท่า (8 เตียง = 8 เท่า)
 *
 *   แก้โดย
 *    - สุ่มคาบส่งใหม่ทุกครั้งในช่วง 940-1060 ms สองเตียงที่บังเอิญชนกันจะแยกกัน
 *      ในรอบถัดไปทันที ไม่ใช่รอ 40 วินาที
 *    - รอบแรกหลังบูตเหลื่อมกันตามเลขเตียง (เตียงละ 111 ms) แพ็กเก็ตจึงกระจายกัน
 *      ทั้งวินาทีตั้งแต่ต้น
 *    - เมล็ดสุ่มมาจาก MAC ของบอร์ด จึงไม่ซ้ำกันแม้แฟลชเฟิร์มแวร์เดียวกันทุกตัว
 *
 *   อัตราการส่งเฉลี่ยยังเท่าเดิม (1 ใบ/วินาที) โครงสร้างแพ็กเก็ตไม่เปลี่ยน
 *   ใช้กับ Host รุ่นใดก็ได้ และใช้ปนกับสเตชันรุ่นเก่าได้
 *
 * ---------------------------------------------------------------------------
 * เปลี่ยนใน V7.5.2: หมุนจอ 180 องศาได้ เพื่อให้ติดตั้งจอได้ทุกทิศทาง
 *   (พอร์ตมาจาก V7.7.1 — ระบบคัดกรองหยดและหน้าคาลิเบรตของ V7.5.1 ไม่เปลี่ยนเลย)
 *
 *   วิธีสลับ: คลิก 3 ครั้ง = เข้าหน้า SET BED ID -> ในหน้านั้น "ดับเบิลคลิก"
 *   = สลับ NORMAL <-> FLIP 180 จอพลิกทันทีให้เห็นผล แล้วบันทึกลง NVS ทันที
 *
 *   ทางเทคนิค: จอ ST7789 172x320 ใช้ setRotation(0) กับ (2) ซึ่งเป็นแนวตั้ง
 *   ขนาดเท่ากันทั้งคู่ (172x320) ต่างกันแค่บิต MX/MY ใน MADCTL พิกัดทุกจุดใน
 *   โค้ดวาดภาพจึงใช้ได้เหมือนเดิมทั้งหมด ไม่ต้องแก้เลย์เอาต์แม้แต่บรรทัดเดียว
 *   และไลบรารีตั้งออฟเซ็ตคอลัมน์ (_colstart/_colstart2 = 34) ไว้เท่ากันทั้งสองทิศ
 *   ภาพจึงไม่เลื่อนออกนอกจอ
 *
 *   ตั้งค่าเริ่มต้นตอนคอมไพล์ได้ที่ TFT_ROTATION_DEFAULT (ถ้าทั้งวอร์ดติดตั้งกลับหัว
 *   เหมือนกันหมด ตั้งเป็น TFT_ROT_FLIP180 แล้วแฟลชทีเดียวจบ)
 *
 * ---------------------------------------------------------------------------
 * เปลี่ยนใน V7.5.1: รื้อระบบคัดกรองหยดและหน้าคาลิเบรตใหม่ทั้งหมด
 *   หน้าจอ การสื่อสาร และการแจ้งเตือนเหมือน V7.5.0 ทุกประการ
 *
 *  ปัญหา 1 "นับเบิ้ล" — ของเดิมเมื่อค่าต่ำกว่าเกณฑ์แต่ยังไม่พ้นเวลากันรัว 55 ms
 *   จะไม่นับ แต่ก็ไม่เปลี่ยนสถานะ ตัวจับจึงยังง้างค้างอยู่ พอพ้น 55 ms ขณะที่
 *   สัญญาณยังต่ำอยู่ ก็นับซ้ำจากหยดเดิม (และนับอีกทุก 55 ms ที่ยังค้าง)
 *   -> ของใหม่นับตอน "พัลส์จบ" ที่จุดเดียว แล้วต้องกลับมานิ่งใต้เกณฑ์ปลด 20 ms
 *      ก่อนจึงรับพัลส์ถัดไป จึงได้ 1 พัลส์ = 1 หยด เสมอ (แก้อาการเหมือนสวิตช์ลั่น)
 *
 *  ปัญหา 2 "หาช่วงต่างยาก" — ของเดิมตั้งเกณฑ์จากค่ากึ่งกลางระหว่างกระเปาะมีน้ำ
 *   กับกระเปาะเปล่า ซึ่งเป็นค่านิ่ง 2 ค่า แต่หยดที่ตกผ่านลำแสงเป็นสัญญาณชั่วขณะ
 *   ที่เบนจากค่าปกติเพียงบางส่วน เกณฑ์กึ่งกลางจึงสูงเกินกว่าจะจับหยดได้จริง
 *   -> ของใหม่วัด "ระยะเบนจากเส้นฐาน" โดยเส้นฐานไล่ตามค่าปกติเองตลอดเวลา
 *      (กันการดริฟต์จากอุณหภูมิ แสงรอบข้าง และแรงดันไฟ) และตั้งเกณฑ์จาก
 *      หยดจริงที่วัดได้ในขั้นตอนคาลิเบรต ไม่ต้องหาค่ากึ่งกลางเองอีก
 *
 *  สิ่งที่เพิ่มในสายสัญญาณ
 *   - อ่าน ADC ที่คาบคงที่ 2 kHz (เดิมอ่านรอบละครั้งตามจังหวะ loop)
 *   - มีเดียน 5 จุด ตัดสไปก์เดี่ยวจาก ADC และจากจังหวะที่ ESP-NOW ส่งข้อมูล
 *   - เส้นฐานปรับอัตโนมัติ และหยุดนิ่งระหว่างที่พัลส์กำลังดำเนินอยู่
 *   - กรองตามความกว้างพัลส์ 2-150 ms (แคบไป = สัญญาณรบกวน, กว้างไป = ไม่ใช่หยด)
 *   - รู้ทิศสัญญาณเอง (หยดทำให้ค่าลดลงหรือเพิ่มขึ้น) ไม่ต้องตั้งค่าเอง
 *   - ถ้าการอ่านขาดช่วงเกิน 25 ms (เช่นเพิ่งวาดจอทั้งหน้า) จะตั้งต้นใหม่
 *     แทนที่จะเดาพัลส์ที่มองเห็นไม่ครบ
 *
 *  หน้าคาลิเบรตใหม่ 3 ขั้น + ตรวจสอบ (กดปุ่มค้าง 3 วินาที) พร้อมจอคลื่นสด
 *   1 NOISE  วัดพื้นสัญญาณรบกวนของเซ็นเซอร์ 3 วินาที (ขีดล่างของฮาร์ดแวร์)
 *   2 DROPS  เรียนรู้จากหยดจริง 10 หยด เก็บความสูงและความกว้างพัลส์
 *   3 RESULT ตั้งเกณฑ์ที่จุดกึ่งกลางระหว่าง "พ้นสัญญาณรบกวน 3 เท่า" กับ
 *            "ต่ำกว่าหยดที่จางที่สุด 55%" แล้วรายงาน SNR ให้เห็นขีดความสามารถจริง
 *   VERIFY   นับหยดสดให้เทียบกับตาตัวเองว่า 1 หยดขึ้น 1 จริง
 *
 * ---------------------------------------------------------------------------
 * เปลี่ยนใน V7.5.0: ออกแบบหน้าจอ TFT ใหม่ทั้งหมด (UX/UI สำหรับใช้งานจริงที่เตียง)
 *  - แนวคิด "IV BAG": หน้าหลักแสดงภาพถุงน้ำเกลือที่ระดับน้ำลดลงจริงตามปริมาณที่ให้ไปแล้ว
 *    พร้อมกระเปาะหยดที่มีภาพเคลื่อนไหวตามหยดจริง และตัวเลขสำคัญเพียง 4 ค่า
 *    (อัตราไหล / ปริมาณคงเหลือ / เวลาที่เหลือ / เวลาที่จะหมด)
 *  - ลดข้อความบนจอลงเหลือเท่าที่จำเป็น ใช้สีและตำแหน่งแทนคำอธิบาย
 *    แถบสถานะสีที่ขอบบนบอกภาวะของเตียงตั้งแต่แรกเห็น (เขียว/เหลือง/ส้ม/แดง/ฟ้า)
 *  - เพิ่มหน้าที่ 4: กราฟแท่งแนวโน้มอัตราไหลย้อนหลัง 30 นาที พร้อมเส้นอัตราเป้าหมาย
 *    ใช้ดูว่าการไหลสม่ำเสมอหรือมีช่วงที่ตกไป โดยไม่ต้องเปิดหน้าเว็บ
 *  - หน้า PLAN และ LINK จัดใหม่เป็นการ์ดตัวเลขใหญ่ อ่านได้จากปลายเตียง
 *  - จอเตือนวิกฤต/ใกล้หมดถุง/Screensaver ออกแบบใหม่ให้เหลือข้อความเท่าที่ต้องอ่าน
 *  - ตรรกะการวัด การสื่อสาร และการแจ้งเตือนทั้งหมดเหมือน V7.4.0 ทุกประการ
 *    (โครงสร้างแพ็กเก็ต Protocol v3 ไม่เปลี่ยน ใช้กับ Host เดิมได้ทันที)
 *
 * ---------------------------------------------------------------------------
 * เพิ่มใน V7.4.0: แจ้งเตือนใกล้หมด (เตรียมถุงใหม่)
 *  - เตือนเมื่อให้สารน้ำไปแล้วถึง % ที่ตั้งจากหน้าเว็บ (ค่าเริ่มต้น 80% ของปริมาตรตามแผน)
 *  - แสดงจอสีส้ม "PREPARE NEXT BAG" + เสียงเตือนเบา 3 ครั้ง ซ้ำทุก 5 นาทีจนกว่าจะกดรับทราบ
 *  - คลิกปุ่มที่เตียง หรือกดรับทราบที่ Host/หน้าเว็บ = รับทราบ (ซิงก์กันทั้งระบบ)
 *  - ไม่นับเป็นเหตุวิกฤต ไม่เข้าจอ EMERGENCY สีแดง
 *
 * สรุปการแก้ไขจาก V7.2.3
 *  1) โครงสร้างแพ็กเก็ต ESP-NOW ตรงกับ Host ทุกไบต์ (มี static_assert ตรวจขนาด)
 *     ส่งอัตราไหล + เวลาตั้งแต่หยดล่าสุด + แรงดันแบตเตอรี่ (ถ้ามีวงจร)
 *  2) รับ Drop factor จาก Host แทนค่าคงที่ 20 gtt/mL
 *  3) แก้แจ้งเตือนสายพับผิด: เดิมเข้า EMERGENCY ทันทีหลังหยดแรก และค้างเมื่อกดหยุดชั่วคราว
 *     -> ใช้เกณฑ์ "ไม่มีหยดนานเกิน 2.5 เท่าของช่วงหยดตามเป้าหมาย (ขั้นต่ำ 8 วินาที)" สูตรเดียวกับ Host
 *  4) รหัสเตือน เร็ว/ช้าเกิน/ครบแผน มาจาก Host (มีหน่วงยืนยัน 20 วินาที) — สายพับตัดสินในเครื่องทันที
 *  5) ค้นหาช่องสัญญาณของ Host อัตโนมัติ (Channel 1-13) เมื่อขาดการเชื่อมต่อ และจำช่องล่าสุด
 *  6) ลดการวาดจอ TFT ทุกรอบ loop -> วาดเฉพาะเมื่อสถานะเปลี่ยน ไม่แย่งเวลาอ่าน ADC ตรวจจับหยด
 *  7) รองรับคำสั่ง "เริ่มถุงใหม่" จากหน้าเว็บ (รีเซ็ตตัวนับ)
 *  8) ในจอ EMERGENCY: คลิก 1 ครั้ง = พักเสียง 2 นาที, ดับเบิลคลิก = หยุด/เริ่มนับ
 *  9) Screensaver ทำงานจริงเมื่อไม่มีการกดปุ่ม 3 นาที (คลิกเพื่อปลุก)
 * 10) ไฟ RGB แสดงสถานะ: แดง=เตือน, เหลือง=หยุดชั่วคราว, น้ำเงิน=ไม่พบ Host, เขียว=ปกติ
 *
 * การใช้ปุ่ม (ปุ่มเดียว)
 *  - คลิก 1 ครั้ง      : เปลี่ยนหน้า 1/2/3/4  (ในจอเตือน = พักเสียง 2 นาที)
 *  - ดับเบิลคลิก       : หยุด/เริ่มนับหยด (PAUSE)
 *  - คลิก 3 ครั้ง      : ตั้งหมายเลขเตียง 1-8
 *  - กดค้าง 3 วินาที   : Calibration Wizard (วัดสัญญาณรบกวน + เรียนรู้จากหยดจริง)
 *  - กดค้าง 5 วินาที   : หน้าผู้พัฒนา
 * ============================================================================
 */

#include <WiFi.h>
#include <esp_now.h>
#include <esp_wifi.h>
#include <Preferences.h>
#include <Adafruit_GFX.h>
#include <Adafruit_ST7789.h>
#include <SPI.h>
#include <time.h>
#include <sys/time.h>

#define APP_VERSION         "7.5.3"

