kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Station-V_7_5_3/ESP32-S3-Station-V_7_5_3.ino
#define TFT_CS              9
#define TFT_DC              10
#define TFT_RST             11
#define TFT_MOSI            12
#define TFT_SCLK            13
#define TFT_BLK             8

// ---- ทิศการแสดงผลของจอ ----
// จอ ST7789 172x320 หมุนได้ 2 ทิศที่ยังเป็นแนวตั้งขนาดเดิม จึงใช้พิกัดชุดเดียวกัน
#define TFT_ROT_NORMAL        0   // สาย USB อยู่ด้านล่าง (ค่ามาตรฐาน)
#define TFT_ROT_FLIP180       2   // กลับหัว 180 องศา สาย USB อยู่ด้านบน
#define TFT_ROTATION_DEFAULT  TFT_ROT_NORMAL   // ค่าเริ่มต้นเมื่อยังไม่เคยตั้งที่หน้าเครื่อง

#define SENSOR_AO_PIN       4
#define BUZZER_PIN          3
#define BTN_PIN             2
#define RGB_LED_PIN         48

// วงจรวัดแบตเตอรี่ (ถ้ามี): ใส่หมายเลขขา ADC ที่ต่อผ่านตัวต้านทานแบ่งแรงดัน 1:1 เช่น 1
// -1 = ไม่มีวงจร -> ส่งค่า 0 และหน้าเว็บ/Host แสดง "N/A"
#define STATION_BAT_ADC_PIN -1
#define BAT_DIVIDER_RATIO   2.0f

// ----------------------------------------------------------------------------
// ตัวตรวจจับหยด (v7.5.1) — ทำงานกับ "ระยะเบนจากเส้นฐาน" ไม่ใช่ค่า ADC สัมบูรณ์
// ----------------------------------------------------------------------------
#define SENSOR_SAMPLE_US        500    // อ่าน ADC ทุก 0.5 ms (2 kHz) พัลส์ 10 ms จึงได้ ~20 จุด
#define SENSOR_MEDIAN_N         5      // มีเดียน 5 จุด ตัดสไปก์เดี่ยวของ ADC/ตอนส่ง ESP-NOW
#define SENSOR_GAP_RESYNC_MS    25     // อ่านขาดช่วงนานกว่านี้ = ตั้งต้นใหม่ ไม่เดาพัลส์ที่เห็นไม่ครบ
// ค่าคงที่เวลาของตัวไล่ตาม คิดจากเวลาจริง (หน่วย 100 ไมโครวินาที) ไม่ใช่จำนวนตัวอย่าง
// เพื่อให้พฤติกรรมคงที่ไม่ว่าลูปหลักจะยุ่งแค่ไหน
#define BASELINE_TAU            5000   // 500 ms — เส้นฐานไล่ตามการดริฟต์ช้า ๆ
#define BASELINE_TAU_FAST       1250   // 125 ms — ตอนถุงแกว่งหรือค่าค้างเหนือเกณฑ์ปลด
#define DELTA_SLOW_TAU          300    // 30 ms  — ตัวตัดองค์ประกอบช้าในสภาวะปกติ
#define DELTA_SLOW_TAU_MOTION   100    // 10 ms  — ตอนถุงแกว่ง ตัดให้แรงขึ้น
#define NOISE_WINDOW_MS         1000   // คาบวัดสัญญาณรบกวนยอดถึงยอด
#define DROP_MIN_WIDTH_MS       2      // พัลส์แคบกว่านี้ = สัญญาณรบกวน ไม่ใช่หยด
#define DROP_MAX_WIDTH_MS       250    // กว้างกว่านี้ = ระดับน้ำเปลี่ยน/มีอะไรบัง ไม่ใช่หยด
#define DROP_REARM_MS           20     // ต้องกลับมานิ่งใต้เกณฑ์ปลดเท่านี้ ก่อนรับหยดถัดไป
#define DROP_REARM_TIMEOUT_MS   300    // กันค้าง: อยู่ในช่วงรอนิ่งนานเกินนี้ = ยึดเส้นฐานใหม่

#define CAL_DEFAULT_TRIGGER     120    // ใช้เมื่อยังไม่เคยคาลิเบรต
#define CAL_MIN_TRIGGER         18
#define CAL_NOISE_MS            3000
#define CAL_POLARITY_MS         6000
#define CAL_LEARN_TIMEOUT_MS    60000
#define CAL_TARGET_DROPS        6      // เก็บให้ครบเท่านี้แล้วจบ (เดิม 10 ทำให้ขั้นที่ 2 นาน)
#define CAL_MIN_DROPS           3      // ขั้นต่ำที่ยอมรับได้
#define CAL_MAX_SAMPLES         8
#define CAL_QUICK_DROPS         3      // ได้เท่านี้และความสูงใกล้เคียงกัน = จบทันที
#define CAL_QUICK_SPREAD_PCT    40

// ---- การเรียนรู้รูปร่างพัลส์ต่อเนื่องหลังคาลิเบรต ----
#define LEARN_DIV               8      // ความเร็วที่ค่าที่เรียนรู้ไล่ตามหยดใหม่ (มาก = ช้า)
#define LEARN_MIN_AMP_PCT       35     // พัลส์ที่เตี้ยกว่านี้ (% ของที่เรียนรู้) = ไม่ใช่หยด
#define LEARN_MAX_WIDTH_MUL     3      // พัลส์ที่กว้างกว่าที่เรียนรู้เกินเท่านี้ = ไม่ใช่หยด
#define LEARN_MAX_RISE_MUL      2      // ขอบขาขึ้นช้ากว่าที่เรียนรู้เกินเท่านี้ = ถุงแกว่ง ไม่ใช่หยด
#define MOTION_WINDOW_MS        200    // คาบตรวจว่าเส้นฐานกำลังเคลื่อน (ถุงแกว่ง/คนไข้เดิน)
#define MOTION_HOLD_MS          2000   // ถือว่ายังเคลื่อนอยู่อีกเท่านี้หลังตรวจพบ
#define CAL_VERIFY_MS           20000
#define SCOPE_TOP               82

// ----------------------------------------------------------------------------
// ค่าคงที่ของระบบสื่อสารและการแจ้งเตือน (ต้องตรงกับ Host)
// ----------------------------------------------------------------------------
#define DEFAULT_ESPNOW_CHANNEL  1
#define MAX_WIFI_CHANNEL        13
#define HOST_TIMEOUT_MS         5000
#define CHANNEL_SCAN_DWELL_MS   2500     // Host ส่ง Sync ทุก 1 วินาที -> รอแต่ละช่อง 2.5 วินาที
#define CHANNEL_SCAN_START_MS   6000     // หลังบูตรอช่องที่จำไว้ก่อน 6 วินาที
#define SEND_INTERVAL_MS        1000     // คาบพื้นฐานของการส่งข้อมูลให้ Host
#define SEND_JITTER_MS          60       // สุ่มบวกลบรอบคาบ กันสองสเตชันส่งชนกันค้างนาน
                                         // (ดูคำอธิบายเหตุผลในหัวไฟล์ V7.5.3)
#define MIN_OCCLUSION_MS        8000
#define MAX_OCCLUSION_MS        300000
#define SCREENSAVER_IDLE_MS     180000
#define SNOOZE_MS               120000
#define NEAR_END_REMIND_MS      300000   // เตือนใกล้หมดซ้ำทุก 5 นาทีจนกว่าจะรับทราบ
#define DEFAULT_NEAR_END_PCT    80

#define ALERT_NONE        0
#define ALERT_TOO_FAST    1
#define ALERT_TOO_SLOW    2
#define ALERT_NEAR_END    3   // ให้ไปแล้วถึง % ที่ตั้ง (เตรียมถุงใหม่)
#define ALERT_COMPLETE    4
#define ALERT_OCCLUSION   5

#define THEME_BG            0x0000
#define THEME_SKYBLUE       0x5DFF
#define THEME_CYAN          0x07FF
#define THEME_PINK          0xFD79
#define THEME_NAVY          0x09CD
#define THEME_DARKBOX       0x18C5
#define THEME_MAROON        0x6000

#define COLOR_WHITE         0xFFFF
#define COLOR_GREEN         0x07E0
#define COLOR_RED           0xF800
#define COLOR_ORANGE        0xFD20
#define COLOR_YELLOW        0xFFE0

// ชุดสีของหน้าจอรุ่นใหม่ (พื้นดำ การ์ดเทาเข้ม ตัวอักษรรองสีเทา)
#define UI_CARD             0x18C5   // พื้นการ์ด
#define UI_BAR              0x0A49   // แถบบนสุด
#define UI_LINE             0x39E7   // เส้นคั่น/แถบว่าง
#define UI_DIM              0x8410   // ข้อความรอง
#define UI_GREEN            0x2FEB   // เขียวอ่านง่ายบนพื้นดำ

#ifndef ST77XX_LIGHTGREY
  #define ST77XX_LIGHTGREY  0xC618
#endif
#ifndef ST77XX_DARKGREY
  #define ST77XX_DARKGREY   0x39E7
#endif

SPIClass SPI_TFT(FSPI);
Adafruit_ST7789 tft = Adafruit_ST7789(&SPI_TFT, TFT_CS, TFT_DC, TFT_RST);
Preferences stationPrefs;

enum AppState {
  STATE_NORMAL_VIEW,
  STATE_EMERGENCY,
  STATE_SCREENSAVER,
  STATE_CREDIT,
  STATE_CONFIG_ID,
  STATE_NEAR_END_NOTICE
};

// ---- สถานะที่ใช้เลือกสีและคำบนจอ ----
// ต้องประกาศไว้ตอนต้นไฟล์ เพราะ Arduino IDE แทรก prototype ของฟังก์ชันไว้ก่อนส่วนแสดงผล
enum UiStatus { UI_OK = 0, UI_FAST, UI_SLOW, UI_NOFLOW, UI_NEAREND, UI_DONE, UI_PAUSED };

AppState currentState       = STATE_NORMAL_VIEW;
int currentNursePage        = 1;
uint8_t currentStationId    = 1;
uint8_t tempConfigStationId = 1;
uint8_t screenRotation      = TFT_ROTATION_DEFAULT;   // 0 = ปกติ, 2 = กลับหัว 180 องศา
unsigned long configAutoSaveTimeout = 0;
unsigned long lastUserActivityTime  = 0;

bool isRunning              = true;
bool isClockSynced          = false;
volatile bool isHostOnline  = false;
volatile int lastHostRssi   = -100;
volatile unsigned long lastHostRecvTime = 0;
bool stateNeedsRedraw       = true;

// ---- สัญญาณและการตรวจจับหยด (ประกาศชนิดไว้ตอนต้นไฟล์ เพราะ Arduino แทรก prototype ก่อนฟังก์ชันแรก) ----
enum DropPhase { DP_IDLE, DP_ACTIVE, DP_REARM };

int8_t  dropPolarity     = -1;                       // -1 = หยดทำให้ค่า ADC ลดลง, +1 = เพิ่มขึ้น
int     dropTriggerDelta = CAL_DEFAULT_TRIGGER;      // เบนจากเส้นฐานเท่านี้ = เริ่มนับว่าเป็นพัลส์
int     dropReleaseDelta = CAL_DEFAULT_TRIGGER * 2 / 5;  // ต่ำกว่านี้ = พัลส์จบ (ฮิสเทอรีซิส)
int     calDropAmp       = 0;                        // ความสูงพัลส์กลางจากตอนคาลิเบรต
int     calNoisePp       = 0;                        // สัญญาณรบกวนยอดถึงยอดตอนคาลิเบรต
uint8_t calSnrX10        = 0;                        // อัตราส่วนสัญญาณต่อสัญญาณรบกวน คูณ 10
uint8_t calQuality       = 0;                        // 0 = ยังไม่คาลิเบรต/อ่อนเกินไป ... 4 = ดีมาก
int     lastDropPeak     = 0;
int     lastDropWidthMs  = 0;
int     lastDropRiseMs   = 0;
int     learnAmp         = 0;    // ความสูงพัลส์ที่เครื่องเรียนรู้ไว้ (0 = ยังไม่รู้จักหยด)
int     learnWidth       = 0;    // ความกว้างพัลส์ที่เรียนรู้ไว้ (ms)
bool    shapeGateEnabled = true; // ปิดชั่วคราวระหว่างขั้นเรียนรู้ในหน้าคาลิเบรต

// ----------------------------------------------------------------------------
// โครงสร้างข้อมูลรับ-ส่ง ESP-NOW (Protocol v2) — ต้องเหมือนกับ Host ทุกไบต์
// ----------------------------------------------------------------------------
typedef struct __attribute__((packed)) struct_message {
  uint8_t  stationId;
  uint8_t  isRunning;
  uint32_t totalDrops;
  uint32_t periodDrops;
  float    flowRateHr;
  uint32_t msSinceLastDrop;
  float    batteryVolts;
  uint8_t  flags;            // bit0 = พยาบาลกดรับทราบเตือนใกล้หมดที่เตียง
} struct_message;            // 23 bytes

typedef struct __attribute__((packed)) struct_host_sync {
  uint32_t epochTime;
  uint8_t  isSynced;
  uint8_t  stationId;
  float    targetRateHr;
  float    totalPlanMl;
  uint8_t  alertCode;
  uint8_t  dropFactor;
  uint8_t  resetSeq;
  uint8_t  hostChannel;
  uint8_t  nearEndPct;       // % ของปริมาตรตามแผนที่เริ่มเตือนใกล้หมด
  uint8_t  flags;            // bit0 = Host บันทึกว่ารับทราบเตือนใกล้หมดแล้ว
} struct_host_sync;          // 20 bytes

static_assert(sizeof(struct_message) == 23, "struct_message must be 23 bytes (match Host)");
static_assert(sizeof(struct_host_sync) == 20, "struct_host_sync must be 20 bytes (match Host)");

struct_message myData;
uint8_t broadcastAddress[] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};

uint32_t totalDrops                 = 0;
uint32_t periodDropsCounter         = 0;

float currentFlowRate_ml_hr         = 0.0;
float currentGttMin                 = 0.0;
float totalVolumeMl                 = 0.0;

// ค่าจาก Host (0 = Host ยังไม่ได้ตั้งค่า)
volatile float targetRateHr         = 0.0;
volatile float totalPlanMl          = 0.0;
volatile uint8_t hostAlertCode      = ALERT_NONE;
volatile uint8_t dropFactor         = 20;
volatile uint8_t hostReportedChannel = 0;
volatile bool pendingCounterReset   = false;
volatile uint8_t nearEndPct         = DEFAULT_NEAR_END_PCT;
volatile bool hostNearEndAck        = false;   // Host ยืนยันว่ารับทราบแล้ว
bool nearEndAckRequest              = false;   // กดรับทราบที่เตียง รอ Host ยืนยัน
unsigned long nearNextChimeTime     = 0;
uint8_t nearChimeRemaining          = 0;
int16_t knownResetSeq               = -1;

uint8_t espnowChannel               = DEFAULT_ESPNOW_CHANNEL;
uint8_t savedChannel                = DEFAULT_ESPNOW_CHANNEL;
unsigned long lastChannelHopTime    = 0;

unsigned long lastDropTimestamp     = 0;
bool hasFirstDropOccurred           = false;
bool skipNextInterval               = false;

unsigned long lastSendTime          = 0;
unsigned long nextSendDelay         = SEND_INTERVAL_MS;   // คาบของรอบถัดไป (สุ่มใหม่ทุกครั้ง)
unsigned long lastDebounceTime      = 0;
unsigned long snoozeUntilTime       = 0;
const unsigned long minDropInterval = 55;

unsigned long buzzerBeepUntil       = 0;
unsigned long buzzerNextBeepTime    = 0;

