kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Station-V_7_5_3/ESP32-S3-Station-V_7_5_3.ino
void drawHoldProgressHUD(unsigned long holdDur) {
  int boxX = 6, boxY = 100, boxW = 160, boxH = 100;
  tft.fillRoundRect(boxX, boxY, boxW, boxH, 8, THEME_NAVY);
  tft.drawRoundRect(boxX, boxY, boxW, boxH, 8, THEME_CYAN);

  int barX = boxX + 15;
  int barY = boxY + 48;
  int barW = 130;
  int barH = 12;

  if (holdDur < 3000) {
    int fill = map(holdDur, 400, 3000, 0, barW);
    if (fill < 0) fill = 0;
    if (fill > barW) fill = barW;

    drawCenteredString("BUTTON HOLDING", boxY + 12, 1, THEME_SKYBLUE, THEME_NAVY);
    drawCenteredString("-> CALIBRATE (3s)", boxY + 28, 1, COLOR_YELLOW, THEME_NAVY);
    tft.drawRect(barX, barY, barW, barH, COLOR_WHITE);
    tft.fillRect(barX + 1, barY + 1, fill, barH - 2, THEME_PINK);
    drawCenteredString("Release <3s = Cancel", boxY + 82, 1, ST77XX_LIGHTGREY, THEME_NAVY);
  }
  else if (holdDur < 5000) {
    int fill = map(holdDur, 3000, 5000, 0, barW);
    if (fill < 0) fill = 0;
    if (fill > barW) fill = barW;

    drawCenteredString("RELEASE = CALIB", boxY + 12, 1, COLOR_GREEN, THEME_NAVY);
    drawCenteredString("-> CREDITS (5s)", boxY + 28, 1, THEME_PINK, THEME_NAVY);
    tft.drawRect(barX, barY, barW, barH, COLOR_WHITE);
    tft.fillRect(barX + 1, barY + 1, fill, barH - 2, THEME_CYAN);
  }
  else {
    drawCenteredString(">> CREDITS READY <<", boxY + 14, 1, COLOR_GREEN, THEME_NAVY);
    drawCenteredString("RELEASE TO VIEW", boxY + 30, 1, COLOR_YELLOW, THEME_NAVY);
    tft.drawRect(barX, barY, barW, barH, COLOR_WHITE);
    tft.fillRect(barX + 1, barY + 1, barW - 2, barH - 2, COLOR_GREEN);
  }
}

// ============================================================================
// เครื่องตรวจจับหยด v7.5.1 — ตัวกรอง + เส้นฐานปรับอัตโนมัติ + จับเป็น "เหตุการณ์"
// ----------------------------------------------------------------------------
// ปัญหาของ v7.5.0 ที่แก้ตรงนี้
//  1) นับเบิ้ล: โค้ดเดิมเมื่อค่าต่ำกว่าเกณฑ์แต่ยังไม่พ้นเวลากันรัว จะ "ไม่นับ
//     แต่ก็ไม่เปลี่ยนสถานะ" ตัวจับจึงยังง้างอยู่ พอพ้น 55 ms ขณะที่สัญญาณยัง
//     ต่ำอยู่ ก็นับซ้ำจากหยดเดิมทันที (และนับอีกทุก ๆ 55 ms ที่ค้างอยู่)
//     -> ของใหม่นับตอน "พัลส์จบ" ที่เดียว และต้องกลับมานิ่งใต้เกณฑ์ปลดก่อน
//        จึงจะรับหยดถัดไปได้ 1 พัลส์ = 1 หยด เสมอ
//  2) หาช่วงต่างยาก: โค้ดเดิมตั้งเกณฑ์จากค่ากึ่งกลางระหว่าง "กระเปาะมีน้ำ" กับ
//     "กระเปาะเปล่า" ซึ่งเป็นค่านิ่งสองค่า แต่หยดที่ตกผ่านลำแสงเป็นสัญญาณชั่วขณะ
//     ที่เบนจากค่าปกติเพียงบางส่วน เกณฑ์กึ่งกลางจึงสูงเกินจะจับหยดได้
//     -> ของใหม่วัดจาก "ระยะเบนจากเส้นฐาน" ที่ไล่ตามค่าปกติเองตลอดเวลา
//        และตั้งเกณฑ์จากหยดจริงที่วัดได้ในขั้นตอนคาลิเบรต
// ============================================================================

int  sensorRaw          = 0;      // ค่าดิบล่าสุดจาก ADC
int  sensorFiltered     = 0;      // หลังผ่านมีเดียน (ตัดสไปก์เดี่ยว)
long baselineAcc        = 0;      // เส้นฐาน เก็บคูณ 256 ไว้ให้ละเอียด
int  sensorBaseline     = 0;      // เส้นฐาน = ค่าปกติตอนไม่มีหยด
int  sensorDelta        = 0;      // ระยะเบนจากเส้นฐานในทิศที่แปลว่า "มีหยด"
int  sensorNoisePp      = 0;      // สัญญาณรบกวนยอดถึงยอดของช่วงที่ไม่มีหยด
long deltaSlowAcc       = 0;      // ตัวตามค่าเบนแบบช้า (คูณ 256)
int  deltaSlow          = 0;
int  deltaEdge          = 0;      // ส่วนที่ไต่ขึ้นเร็วของสัญญาณ = สิ่งที่ตัวตรวจจับใช้จริง
bool sensorReady        = false;

int medBuf[SENSOR_MEDIAN_N];
uint8_t medIdx = 0;
uint8_t medFill = 0;

int  noiseMin = 4095, noiseMax = 0;
unsigned long noiseWindowStart = 0;

DropPhase dropPhase       = DP_IDLE;
unsigned long dropPhaseMs = 0;    // เวลาที่เข้าเฟสปัจจุบัน
unsigned long dropSettleMs = 0;   // ครั้งล่าสุดที่สัญญาณนิ่งใต้เกณฑ์ปลด
unsigned long dropRiseMs  = 0;    // เวลาที่ใช้ไต่จากเกณฑ์เข้าถึงยอดพัลส์
uint32_t baselineRecovers = 0;    // จำนวนครั้งที่ต้องยึดเส้นฐานใหม่เพราะระดับเลื่อนค้าง
uint32_t completedPulses  = 0;    // จำนวนพัลส์ที่ผ่านเกณฑ์ทั้งหมด (ให้หน้าคาลิเบรตอ่าน)
uint32_t sampleGaps       = 0;    // จำนวนครั้งที่การอ่านขาดช่วงนานผิดปกติ

// ---- ตรวจว่าเส้นฐานกำลังเคลื่อน (ถุงน้ำเกลือแกว่งตอนคนไข้เดิน) ----
int  baselineRef          = 0;
unsigned long motionCheckMs = 0;
unsigned long motionUntil = 0;
int  motionLevel          = 0;
bool inMotion             = false;
int  dropPeakDelta        = 0;
uint32_t lastSampleUs     = 0;
uint32_t rejectedPulses   = 0;    // พัลส์ที่คัดทิ้ง (แคบหรือกว้างผิดปกติ)

// อ่านหลายครั้งแล้วเฉลี่ย ใช้ตั้งเส้นฐานตอนเริ่ม เพื่อไม่ให้ตัวอย่างเดียวที่บังเอิญ
// ตกบนยอดสัญญาณรบกวนกลายเป็นเส้นฐานที่เพี้ยนไปทั้งรอบ
int readSensorAverage(int n) {
  long sum = 0;
  for (int i = 0; i < n; i++) { sum += analogRead(SENSOR_AO_PIN); delayMicroseconds(200); }
  return (int)(sum / n);
}

void resetSignalChain(int seed) {
  for (int i = 0; i < SENSOR_MEDIAN_N; i++) medBuf[i] = seed;
  medIdx = 0; medFill = SENSOR_MEDIAN_N;
  sensorFiltered = seed;
  baselineAcc = (long)seed * 256;
  sensorBaseline = seed;
  sensorDelta = 0;
  deltaSlowAcc = 0;
  deltaSlow = 0;
  deltaEdge = 0;
  dropPhase = DP_REARM;
  dropPhaseMs = millis();
  dropSettleMs = dropPhaseMs;
  dropPeakDelta = 0;
  noiseMin = seed; noiseMax = seed;
  noiseWindowStart = millis();
  sensorReady = true;
}

int pushMedian(int v) {
  medBuf[medIdx] = v;
  medIdx = (uint8_t)((medIdx + 1) % SENSOR_MEDIAN_N);
  if (medFill < SENSOR_MEDIAN_N) medFill++;
  int t[SENSOR_MEDIAN_N];
  memcpy(t, medBuf, sizeof(t));
  for (int i = 1; i < SENSOR_MEDIAN_N; i++) {         // เรียงแบบแทรก (N=5 เร็วกว่า qsort)
    int k = t[i], j = i - 1;
    while (j >= 0 && t[j] > k) { t[j + 1] = t[j]; j--; }
    t[j + 1] = k;
  }
  return t[SENSOR_MEDIAN_N / 2];
}

// delta > 0 = สัญญาณเบนไปทางที่แปลว่า "มีหยดผ่านลำแสง"
// dropPolarity -1 = หยดทำให้ค่าลดลง (ค่าเริ่มต้น), +1 = หยดทำให้ค่าเพิ่มขึ้น
inline int deltaFromBaseline(int filtered) {
  return (dropPolarity < 0) ? (sensorBaseline - filtered) : (filtered - sensorBaseline);
}

// ปรับเกณฑ์ตามความสูงพัลส์ที่เรียนรู้ไว้ แต่ห้ามต่ำกว่าพื้นสัญญาณรบกวน
void adaptTriggerFromLearning() {
  if (learnAmp <= 0) return;
  int t = (learnAmp * 45) / 100;
  int floorN = calNoisePp * 3;
  if (floorN < CAL_MIN_TRIGGER) floorN = CAL_MIN_TRIGGER;
  if (t < floorN) t = floorN;
  dropTriggerDelta = t;
  dropReleaseDelta = t * 2 / 5;
  if (dropReleaseDelta < 2) dropReleaseDelta = 2;
}

// เรียนรู้จากหยดที่เพิ่งผ่านเกณฑ์ ทำต่อเนื่องตลอดการใช้งาน ไม่ใช่เฉพาะตอนคาลิเบรต
// จึงตามการเปลี่ยนแปลงช้า ๆ ได้เอง (ฝุ่นเกาะ ไฟอ่อนลง ท่าทางของสายเปลี่ยน)
void learnFromPulse(int peak, int width) {
  if (learnAmp <= 0) { learnAmp = peak; learnWidth = width; }
  else {
    learnAmp   += (peak  - learnAmp)  / LEARN_DIV;
    learnWidth += (width - learnWidth) / LEARN_DIV;
  }
  if (learnWidth < DROP_MIN_WIDTH_MS) learnWidth = DROP_MIN_WIDTH_MS;
  adaptTriggerFromLearning();
}

// พัลส์นี้ "หน้าตาเหมือนหยด" ที่เครื่องรู้จักหรือไม่
// ใช้คัดจังหวะที่ถุงน้ำเกลือแกว่งตอนคนไข้เดิน ซึ่งทำให้สัญญาณเบนแรงแต่ไต่ขึ้นช้า
// และค้างนานกว่าหยดจริงหลายเท่า
bool pulseLooksLikeDrop(int peak, int width, int riseMs) {
  if (width < DROP_MIN_WIDTH_MS || width > DROP_MAX_WIDTH_MS) return false;
  if (!shapeGateEnabled || learnAmp <= 0) return true;

  (void)riseMs;
  if (peak < (learnAmp * LEARN_MIN_AMP_PCT) / 100) return false;      // จางเกินกว่าจะเป็นหยด

  int wMax = learnWidth * LEARN_MAX_WIDTH_MUL + 20;
  if (width > wMax) return false;                                     // ค้างนานผิดรูปหยด
  return true;
}

// บันทึกหยด 1 หยด — eventMs คือเวลาที่พัลส์ "เริ่ม" ซึ่งเป็นจังหวะจริงที่หยดผ่านลำแสง
void registerDrop(unsigned long eventMs) {
  totalDrops++;
  periodDropsCounter++;

  isDropFalling = true;
  dropFallStartTime = millis();
  animDropY = CHAMBER_NOZZLE_Y;

