kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Station-V_7_5_3/ESP32-S3-Station-V_7_5_3.ino
int16_t scopeCol[SCOPE_W];
uint8_t scopeHead = 0;
int scopeColMax = 0;
int scopeFull = 200;                   // ค่าที่ทำให้แท่งสูงเต็มจอ
int scopeFixedFull = 0;                // > 0 = ล็อกสเกลไว้เอง (ใช้ตอนวัดสัญญาณรบกวน)
unsigned long scopeColStart = 0;

void scopeReset() {
  for (int i = 0; i < SCOPE_W; i++) scopeCol[i] = 0;
  scopeHead = 0;
  scopeColMax = 0;
  scopeColStart = millis();
}

void scopePush(int delta) {
  if (delta < 0) delta = 0;
  if (delta > scopeColMax) scopeColMax = delta;
  unsigned long now = millis();
  if (now - scopeColStart < SCOPE_MS_PER_COL) return;
  scopeColStart = now;
  scopeCol[scopeHead] = (int16_t)scopeColMax;
  scopeHead = (uint8_t)((scopeHead + 1) % SCOPE_W);
  scopeColMax = delta;
}

void scopeFrame(int y) {
  tft.drawRect(SCOPE_X - 1, y - 1, SCOPE_W + 2, SCOPE_H + 2, UI_LINE);
}

int scopeYof(int y, int value) {
  if (scopeFull < 20) scopeFull = 20;
  long h = (long)value * (SCOPE_H - 1) / scopeFull;
  if (h < 0) h = 0;
  if (h > SCOPE_H - 1) h = SCOPE_H - 1;
  return y + SCOPE_H - 1 - (int)h;
}

void scopeDraw(int y) {
  // ปรับสเกลอัตโนมัติให้พัลส์ที่เห็นอยู่พอดีจอ (หรือใช้สเกลที่ล็อกไว้)
  if (scopeFixedFull > 0) {
    scopeFull = scopeFixedFull;
  } else {
    int peak = dropTriggerDelta * 2;
    for (int i = 0; i < SCOPE_W; i++) if (scopeCol[i] > peak) peak = scopeCol[i];
    scopeFull = (peak * 12) / 10;
    if (scopeFull < 40) scopeFull = 40;
  }

  int yTrig = scopeYof(y, dropTriggerDelta);
  int yRel  = scopeYof(y, dropReleaseDelta);
  int yNoise = scopeYof(y, sensorNoisePp);

  for (int i = 0; i < SCOPE_W; i++) {
    // การวาดกราฟทั้งแถบใช้เวลาหลายสิบมิลลิวินาทีบนจอจริง ถ้าปล่อยให้ขาดการอ่าน
    // ตลอดช่วงนั้น ตัวตรวจจับจะถูกดีดกลับไปเฟสรอนิ่งทุกครั้งที่วาดจอ จนไม่เหลือ
    // จังหวะเฝ้ารอหยดเลย จึงต้องแทรกการอ่านเซนเซอร์ไว้ระหว่างวาดด้วย
    if ((i % 12) == 0) serviceDropSensor(false);
    int x = SCOPE_X + i;
    int v = scopeCol[(scopeHead + i) % SCOPE_W];
    int yTop = scopeYof(y, v);

    tft.drawFastVLine(x, y, yTop - y, THEME_BG);                       // ลบของเดิมด้านบน
    if (yTop < y + SCOPE_H)
      tft.drawFastVLine(x, yTop, y + SCOPE_H - yTop,
                        (v >= dropTriggerDelta) ? COLOR_YELLOW : THEME_SKYBLUE);
    // เส้นอ้างอิงวาดทับเฉพาะจุดที่เป็นพื้นหลัง (ทุก ๆ 2 พิกเซลให้เป็นเส้นประ)
    if ((i % 4) < 2) {
      if (dropTriggerDelta < scopeFull && yTrig  < yTop) tft.drawPixel(x, yTrig,  COLOR_ORANGE);
      if (dropReleaseDelta < scopeFull && yRel   < yTop) tft.drawPixel(x, yRel,   THEME_PINK);
      if (sensorNoisePp    < scopeFull && yNoise < yTop) tft.drawPixel(x, yNoise, UI_DIM);
    }
  }
}

// ============================================================================
// ตัวช่วยของหน้าคาลิเบรต
// ============================================================================
int calPeaks[CAL_MAX_SAMPLES];
int calWidths[CAL_MAX_SAMPLES];
int calCount = 0;

int calMedian(int *src, int n) {
  int t[CAL_MAX_SAMPLES];
  memcpy(t, src, sizeof(int) * n);
  for (int i = 1; i < n; i++) {
    int k = t[i], j = i - 1;
    while (j >= 0 && t[j] > k) { t[j + 1] = t[j]; j--; }
    t[j + 1] = k;
  }
  return t[n / 2];
}

int calMinOf(int *src, int n) {
  int m = src[0];
  for (int i = 1; i < n; i++) if (src[i] < m) m = src[i];
  return m;
}

int calMaxOf(int *src, int n) {
  int m = src[0];
  for (int i = 1; i < n; i++) if (src[i] > m) m = src[i];
  return m;
}

const char* calQualityWord(uint8_t q) {
  switch (q) {
    case 4:  return "EXCELLENT";
    case 3:  return "GOOD";
    case 2:  return "FAIR";
    case 1:  return "POOR";
    default: return "TOO WEAK";
  }
}

uint16_t calQualityColor(uint8_t q) {
  switch (q) {
    case 4:  return COLOR_GREEN;
    case 3:  return UI_GREEN;
    case 2:  return COLOR_YELLOW;
    case 1:  return COLOR_ORANGE;
    default: return COLOR_RED;
  }
}

void calHeader(const char* step, const char* line1, const char* line2) {
  tft.fillScreen(THEME_BG);
  tft.fillRect(0, 0, 172, 28, THEME_PINK);
  drawCenteredString("CALIBRATION", 8, 1, COLOR_WHITE, THEME_PINK);
  drawCenteredString(step, 36, 1, COLOR_YELLOW, THEME_BG);
  drawCenteredString(line1, 52, 1, COLOR_WHITE, THEME_BG);
  drawCenteredString(line2, 66, 1, UI_DIM, THEME_BG);
  scopeFrame(SCOPE_TOP);
  tft.fillRoundRect(6, 164, 160, 122, 6, THEME_NAVY);
}

bool calButtonPressed() { return digitalRead(BTN_PIN) == LOW; }

// ลูปหลักไม่ได้ทำงานระหว่างอยู่ในหน้าคาลิเบรต จึงต้องมีตัวปิดเสียงของตัวเอง
// (ใช้ beepNonBlocking ตรงนี้ไม่ได้ เพราะไม่มีใครเรียก noTone ให้)
unsigned long calBeepUntil = 0;
void calBeep(uint16_t freq, uint16_t ms) { tone(BUZZER_PIN, freq); calBeepUntil = millis() + ms; }
void calServiceBeep() {
  if (calBeepUntil && millis() >= calBeepUntil) { noTone(BUZZER_PIN); calBeepUntil = 0; }
}

void calWaitRelease() {
  while (digitalRead(BTN_PIN) == LOW) delay(10);
  delay(60);
}

// แถวค่าตัวเลขในการ์ดผลลัพธ์ (ล้างพื้นก่อนเขียนเสมอ เพื่อไม่ให้ตัวเลขเก่าค้าง)
void calRow(int y, const String &label, const String &value, uint16_t col) {
  tft.fillRect(10, y, 152, 14, THEME_NAVY);
  textAt(label, 12, y, 1, UI_DIM, THEME_NAVY);
  textAt(value, 78, y, 1, col, THEME_NAVY);
}

// ============================================================================
// ขั้นที่ 1 — วัดพื้นสัญญาณรบกวน (ไม่ต้องมีหยด)
// ได้ค่า: เส้นฐาน และสัญญาณรบกวนยอดถึงยอด ซึ่งเป็น "ขีดล่าง" ของเซ็นเซอร์ตัวนี้
// ============================================================================
bool calStepNoise() {
  calHeader("STEP 1 OF 3   NOISE", "NO DROPS PLEASE", "measuring sensor noise");
  drawCenteredString("CLICK = CANCEL", 296, 1, UI_DIM, THEME_BG);
  scopeReset();

  dropTriggerDelta = 4000;            // ปิดการจับพัลส์ชั่วคราว ให้วัดเฉพาะสัญญาณรบกวน
  dropReleaseDelta = 3999;
  scopeFixedFull = 120;               // ซูมให้เห็นย่านสัญญาณรบกวนชัด ๆ
  resetSignalChain(readSensorAverage(16));

  int wMin = 4095, wMax = 0;
  unsigned long start = millis();
  unsigned long lastDraw = 0;

  while (millis() - start < CAL_NOISE_MS) {
    if (serviceDropSensor(false)) { /* ไม่นับระหว่างคาลิเบรต */ }
    scopePush(deltaEdge);   // แสดงสัญญาณเดียวกับที่ตัวตรวจจับใช้ตัดสิน
    if (sensorFiltered < wMin) wMin = sensorFiltered;
    if (sensorFiltered > wMax) wMax = sensorFiltered;

