kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Station-V_7_5_3/ESP32-S3-Station-V_7_5_3.ino
void togglePause() {
  isRunning = !isRunning;
  currentFlowRate_ml_hr = 0.0f;
  currentGttMin = 0.0f;
  if (isRunning) {
    soundStart();
    // เริ่มนับเวลาใหม่หลังกลับมาทำงาน ไม่ให้ช่วงที่หยุดถูกนับเป็นสายพับหรือใช้คำนวณ rate
    if (hasFirstDropOccurred) {
      lastDropTimestamp = millis();
      skipNextInterval = true;
    }
  } else {
    soundStop();
    noTone(BUZZER_PIN);
  }
  stateNeedsRedraw = true;
}

String getStationClockStr() {
  if (!isClockSynced) return String("--:--");
  time_t now;
  time(&now);
  struct tm *timeinfo = localtime(&now);
  char buf[12];
  strftime(buf, sizeof(buf), "%H:%M", timeinfo);
  return String(buf);
}

// ============================================================================
// ส่วนแสดงผล (UI v2) — เน้นอ่านง่ายจากปลายเตียง ใช้ข้อความเท่าที่จำเป็น
//   หน้า 1 IV BAG  : ภาพถุงน้ำเกลือ + กระเปาะหยด + ตัวเลขสำคัญ 4 ค่า
//   หน้า 2 PLAN    : แผนการให้สารน้ำและเวลา (ตัวเลขใหญ่ 4 ค่า)
//   หน้า 3 LINK    : สถานะการเชื่อมต่อและเซนเซอร์
//   หน้า 4 TREND   : กราฟแท่งแนวโน้มอัตราไหลย้อนหลัง 30 นาที
// ทุกหน้าวาดเฉพาะส่วนที่ค่าเปลี่ยน เพื่อไม่ให้ SPI แย่งเวลาการอ่านเซนเซอร์
// ============================================================================

UiStatus uiStatusOf(uint8_t code) {
  if (!isRunning) return UI_PAUSED;
  switch (code) {
    case ALERT_OCCLUSION: return UI_NOFLOW;
    case ALERT_TOO_FAST:  return UI_FAST;
    case ALERT_TOO_SLOW:  return UI_SLOW;
    case ALERT_COMPLETE:  return UI_DONE;
    case ALERT_NEAR_END:  return UI_NEAREND;
    default:              return UI_OK;
  }
}

uint16_t uiStatusColor(UiStatus s) {
  switch (s) {
    case UI_OK:      return UI_GREEN;
    case UI_FAST:    return COLOR_ORANGE;
    case UI_SLOW:    return COLOR_YELLOW;
    case UI_NOFLOW:  return COLOR_RED;
    case UI_NEAREND: return COLOR_ORANGE;
    case UI_DONE:    return THEME_CYAN;
    default:         return THEME_SKYBLUE;
  }
}

const char* uiStatusWord(UiStatus s) {
  switch (s) {
    case UI_OK:      return "NORMAL";
    case UI_FAST:    return "TOO FAST";
    case UI_SLOW:    return "TOO SLOW";
    case UI_NOFLOW:  return "NO FLOW";
    case UI_NEAREND: return "NEXT BAG";
    case UI_DONE:    return "COMPLETE";
    default:         return "PAUSED";
  }
}

// ---- ตัวช่วยวางข้อความ (ฟอนต์มาตรฐาน: 1 ตัวอักษร = 6xsize กว้าง, 8xsize สูง) ----
void textAt(const String &s, int x, int y, uint8_t size, uint16_t col, uint16_t bg) {
  tft.setTextSize(size);
  tft.setTextColor(col, bg);
  tft.setCursor(x, y);
  tft.print(s);
}

void textRight(const String &s, int xRight, int y, uint8_t size, uint16_t col, uint16_t bg) {
  textAt(s, xRight - (int)s.length() * 6 * size, y, size, col, bg);
}

void textCenterIn(const String &s, int x, int w, int y, uint8_t size, uint16_t col, uint16_t bg) {
  textAt(s, x + (w - (int)s.length() * 6 * size) / 2, y, size, col, bg);
}

// เติมช่องว่างท้ายข้อความให้ยาวคงที่ เพื่อเขียนทับของเดิมได้โดยไม่ต้องล้างพื้นที่ (ไม่กะพริบ)
String padTo(const String &s, unsigned int width) {
  String out = s;
  while (out.length() < width) out += ' ';
  return out;
}

// ---- ค่าที่ใช้ร่วมกันหลายหน้า ----
int remainingMlInt() {
  float r = totalPlanMl - totalVolumeMl;
  if (r < 0) r = 0;
  return (int)(r + 0.5f);
}

int infusedPct() {
  if (totalPlanMl <= 0) return -1;
  int p = (int)(totalVolumeMl * 100.0f / totalPlanMl + 0.5f);
  return (p > 100) ? 100 : p;
}

// นาทีที่เหลือจนหมดถุง (-1 = คำนวณไม่ได้)
int minutesLeft() {
  if (totalPlanMl <= 0) return -1;
  if (!isRunning || isLocallyOccluded()) return -1;
  float calcRate = (currentFlowRate_ml_hr > 5.0f) ? currentFlowRate_ml_hr : (float)targetRateHr;
  if (calcRate <= 0) return -1;
  return (int)((remainingMlInt() / calcRate) * 60.0f);
}

String timeLeftText(bool compact) {
  int m = minutesLeft();
  if (m < 0) return compact ? String("--h--m") : String("--h --m");
  char b[16];
  snprintf(b, sizeof(b), compact ? "%dh%02dm" : "%dh %02dm", m / 60, m % 60);
  return String(b);
}

String endClockText() {
  int m = minutesLeft();
  if (!isClockSynced || m < 0) return String("--:--");
  time_t now;
  time(&now);
  time_t fin = now + ((time_t)m * 60);
  char buf[8];
  strftime(buf, sizeof(buf), "%H:%M", localtime(&fin));
  return String(buf);
}

// ---- แถบสัญญาณ Host ----
void drawLinkBars(int x, int y, int rssi, bool online) {
  int bars = 0;
  uint16_t col = UI_GREEN;
  if (online) {
    if (rssi >= -65)      { bars = 4; col = UI_GREEN; }
    else if (rssi >= -75) { bars = 3; col = THEME_CYAN; }
    else if (rssi >= -85) { bars = 2; col = COLOR_ORANGE; }
    else                  { bars = 1; col = COLOR_RED; }
  }
  int h[4] = {4, 7, 10, 13};
  for (int i = 0; i < 4; i++) {
    int bx = x + i * 4;
    tft.fillRect(bx, y + (13 - h[i]), 3, h[i], (i < bars) ? col : UI_LINE);
  }
  if (!online) {
    tft.drawLine(x, y, x + 14, y + 13, COLOR_RED);
    tft.drawLine(x, y + 13, x + 14, y, COLOR_RED);
  }
}

// ---- แถบบนสุด: ป้ายเตียงสีตามสถานะ | นาฬิกา | สัญญาณ ----
void drawTopBar(bool force) {
  UiStatus st = uiStatusOf(uiAlertCode);
  String clockStr = getStationClockStr();
  int bars = isHostOnline ? lastHostRssi : -999;

  if (force) {
    tft.fillRect(0, 0, 172, 22, UI_BAR);
    tft.fillRect(0, 22, 172, 2, uiStatusColor(st));
    cacheStatusBar = (int)st;
    cacheClock = "";
    cacheBars = -9999;
  } else if ((int)st != cacheStatusBar) {
    cacheStatusBar = (int)st;
    tft.fillRect(0, 22, 172, 2, uiStatusColor(st));
    cacheBedChip = false;
  }

  if (!cacheBedChip || force) {
    cacheBedChip = true;
    char bed[8];
    snprintf(bed, sizeof(bed), "B%02d", currentStationId);
    tft.fillRoundRect(4, 3, 30, 16, 4, uiStatusColor(st));
    textCenterIn(String(bed), 4, 30, 7, 1, THEME_BG, uiStatusColor(st));
  }

  if (clockStr != cacheClock) {
    cacheClock = clockStr;
    textCenterIn(clockStr, 46, 80, 7, 1, COLOR_WHITE, UI_BAR);
  }

  int barKey = (bars == -999) ? -999 : (bars / 5);
  if (barKey != cacheBars) {
    cacheBars = barKey;
    tft.fillRect(148, 4, 18, 14, UI_BAR);
    drawLinkBars(150, 4, lastHostRssi, isHostOnline);
  }
}

