kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Station-V_7_5_3/ESP32-S3-Station-V_7_5_3.ino
// ---- จุดบอกหน้า ----
void drawPageDots(int activeIdx, int y) {
  int count = 4;
  int w = count * 12 - 6;
  int x = (172 - w) / 2;
  tft.fillRect(0, y - 2, 172, 8, THEME_BG);
  for (int i = 0; i < count; i++) {
    if (i == activeIdx) tft.fillRoundRect(x + i * 12, y, 8, 4, 2, THEME_SKYBLUE);
    else                tft.fillRoundRect(x + i * 12, y, 6, 4, 2, UI_LINE);
  }
}

// ---- แถบความคืบหน้า ----
void drawProgressBar(int x, int y, int w, int h, int pct, uint16_t fill) {
  if (pct < 0) pct = 0;
  if (pct > 100) pct = 100;
  tft.fillRoundRect(x, y, w, h, h / 2, UI_CARD);
  int fw = w * pct / 100;
  if (fw >= h) tft.fillRoundRect(x, y, fw, h, h / 2, fill);
  else if (fw > 0) tft.fillRect(x, y, fw, h, fill);
}

// ============================================================================
// หน้า 1: IV BAG — ภาพถุงน้ำเกลือ + กระเปาะหยด + ตัวเลขสำคัญ
// ============================================================================
#define BAG_X       12
#define BAG_Y       34
#define BAG_W       58
#define BAG_H       124
#define CH_X        26
#define CH_Y        176
#define CH_W        30
#define CH_H        46
#define DROP_X      41
#define RIGHT_X     84

// ระดับน้ำในถุง (วาดใหม่เมื่อเปอร์เซ็นต์เปลี่ยนเท่านั้น)
void drawBagLevel(bool force) {
  int pct = infusedPct();
  int left = (pct < 0) ? 100 : (100 - pct);
  uint16_t liquid = (uiAlertCode == ALERT_NEAR_END) ? COLOR_ORANGE : THEME_CYAN;
  if (!force && left == cacheBagPct) return;
  cacheBagPct = left;

  int innerX = BAG_X + 4, innerY = BAG_Y + 12;
  int innerW = BAG_W - 8, innerH = BAG_H - 8;
  tft.fillRect(innerX, innerY, innerW, innerH, THEME_BG);
  int fillH = innerH * left / 100;
  if (fillH > 3) tft.fillRoundRect(innerX, innerY + (innerH - fillH), innerW, fillH, 4, liquid);
  for (int i = 1; i < 4; i++)
    tft.drawFastHLine(BAG_X + BAG_W - 9, innerY + innerH * i / 4, 5, UI_DIM);

  String s = (pct < 0) ? String("-- LEFT") : (String(left) + "% LEFT");
  textCenterIn(padTo(s, 10), 2, 76, 236, 1, liquid, THEME_BG);
}

void drawChamberStatic() {
  tft.drawRoundRect(CH_X, CH_Y, CH_W, CH_H, 5, COLOR_WHITE);
  tft.fillRect(DROP_X - 1, CH_Y + 4, 3, 6, COLOR_WHITE);
}

// โหมด 0 = รอหยด, 1 = หยดกำลังตก, 2 = พักการนับ, 3 = ไม่มีการไหล
void updateDripAnimation() {
  if (currentState != STATE_NORMAL_VIEW || currentNursePage != 1 || stateNeedsRedraw) return;

  unsigned long now = millis();
  int8_t mode;
  if (!isRunning) mode = 2;
  else if (isDropFalling) mode = 1;
  else if (isLocallyOccluded()) mode = 3;
  else mode = 0;

  if (mode != animModeDrawn) {
    tft.fillRect(CH_X + 2, CH_Y + 12, CH_W - 4, CH_H - 14, THEME_BG);
    drawChamberStatic();
    if (mode == 2) {
      tft.fillRect(DROP_X - 6, CH_Y + 16, 4, 14, COLOR_YELLOW);
      tft.fillRect(DROP_X + 3, CH_Y + 16, 4, 14, COLOR_YELLOW);
    } else if (mode == 3) {
      textAt("!", DROP_X - 5, CH_Y + 15, 2, COLOR_RED, THEME_BG);
    } else {
      tft.fillCircle(DROP_X, CHAMBER_NOZZLE_Y, 2, THEME_CYAN);
    }
    if (mode != 2 && mode != 3) tft.fillRoundRect(CH_X + 3, CH_Y + 32, CH_W - 6, 10, 3, THEME_CYAN);
    animModeDrawn = mode;
    animDropPrevY = CHAMBER_NOZZLE_Y;
    lastAnimFrame = 0;
  }

  if (mode == 1) {
    if (now - lastAnimFrame < 20) return;
    lastAnimFrame = now;
    unsigned long elapsed = now - dropFallStartTime;
    if (elapsed <= DROP_FALL_DURATION) {
      animDropY = CHAMBER_NOZZLE_Y + (int)((float)elapsed / (float)DROP_FALL_DURATION * (CHAMBER_POOL_Y - CHAMBER_NOZZLE_Y));
      if (animDropY != animDropPrevY) {
        tft.fillCircle(DROP_X, animDropPrevY, 2, THEME_BG);
        tft.fillCircle(DROP_X, animDropY, 2, THEME_CYAN);
        animDropPrevY = animDropY;
      }
    } else {
      tft.fillCircle(DROP_X, animDropPrevY, 2, THEME_BG);
      tft.fillRoundRect(CH_X + 3, CH_Y + 30, CH_W - 6, 12, 3, COLOR_WHITE);   // กระเพื่อมที่ผิวน้ำ
      poolFlashUntil = now + 110;
      isDropFalling = false;
    }
  } else if (mode == 0 && poolFlashUntil > 0 && now >= poolFlashUntil) {
    tft.fillRoundRect(CH_X + 3, CH_Y + 32, CH_W - 6, 10, 3, THEME_CYAN);
    tft.fillRect(CH_X + 3, CH_Y + 30, CH_W - 6, 2, THEME_BG);
    poolFlashUntil = 0;
  }
}

void drawPage1Framework() {
  tft.fillScreen(THEME_BG);
  drawTopBar(true);

  tft.fillRect(BAG_X + BAG_W / 2 - 1, BAG_Y, 3, 8, UI_LINE);            // ห่วงแขวน
  tft.drawRoundRect(BAG_X, BAG_Y + 8, BAG_W, BAG_H, 6, COLOR_WHITE);
  tft.fillRect(DROP_X - 1, BAG_Y + BAG_H + 8, 3, 10, UI_LINE);          // สายจากถุงลงกระเปาะ
  drawChamberStatic();
  tft.fillRoundRect(CH_X + 3, CH_Y + 32, CH_W - 6, 10, 3, THEME_CYAN);  // ผิวน้ำในกระเปาะ
  tft.fillRect(DROP_X - 1, CH_Y + CH_H, 3, 8, UI_LINE);                 // สายออกจากกระเปาะ

  textAt("RATE", RIGHT_X + 4, 36, 1, UI_DIM, THEME_BG);
  textAt("mL/h", RIGHT_X + 4, 82, 1, UI_DIM, THEME_BG);
  tft.drawFastHLine(RIGHT_X + 2, 110, 82, UI_LINE);
  textAt("LEFT", RIGHT_X + 4, 118, 1, UI_DIM, THEME_BG);
  tft.drawFastHLine(RIGHT_X + 2, 154, 82, UI_LINE);
  textAt("TIME LEFT", RIGHT_X + 4, 160, 1, UI_DIM, THEME_BG);

  drawPageDots(0, 308);

  cacheBagPct = -999; cacheRate = -9999; cacheTarget = -9999; cacheLeftMl = -9999;
  cachePct = -999; cacheTimeLeft = ""; cacheEndClock = ""; cacheStatusWord = "";
  animModeDrawn = -1;
  poolFlashUntil = 0;
  stateNeedsRedraw = false;
}

void updatePage1Dynamic() {
  drawTopBar(false);
  drawBagLevel(false);

  UiStatus st = uiStatusOf(uiAlertCode);
  int rate = isRunning ? (int)(currentFlowRate_ml_hr + 0.5f) : -1;
  int target = (int)(targetRateHr + 0.5f);

  if (rate != cacheRate || target != cacheTarget) {
    cacheRate = rate; cacheTarget = target;
    tft.fillRect(RIGHT_X + 4, 48, 84, 32, THEME_BG);
    if (!isRunning) textAt("--", RIGHT_X + 4, 48, 4, THEME_SKYBLUE, THEME_BG);
    else textAt(String(rate), RIGHT_X + 4, 48, 4, (st == UI_NOFLOW) ? COLOR_RED : COLOR_WHITE, THEME_BG);
    textAt(padTo(targetRateHr > 0 ? ("SET " + String(target)) : String("SET --"), 9),
           RIGHT_X + 4, 94, 1, THEME_SKYBLUE, THEME_BG);
  }

  int left = (totalPlanMl > 0) ? remainingMlInt() : -1;
  if (left != cacheLeftMl) {
    cacheLeftMl = left;
    textAt(padTo(left >= 0 ? (String(left) + " mL") : String("-- mL"), 7), RIGHT_X + 4, 130, 2, COLOR_WHITE, THEME_BG);
  }

  String tl = timeLeftText(true);
  if (tl != cacheTimeLeft) {
    cacheTimeLeft = tl;
    textAt(padTo(tl, 7), RIGHT_X + 4, 172, 2, COLOR_WHITE, THEME_BG);
  }

  String ec = endClockText();
  if (ec != cacheEndClock) {
    cacheEndClock = ec;
    textAt(padTo("END " + ec, 11), RIGHT_X + 4, 196, 1, UI_DIM, THEME_BG);
  }

  String word = String(uiStatusWord(st));
  if (word != cacheStatusWord) {
    cacheStatusWord = word;
    uint16_t sc = uiStatusColor(st);
    tft.fillRoundRect(RIGHT_X, 214, 84, 40, 6, sc);
    textCenterIn(word, RIGHT_X, 84, 229, 1, THEME_BG, sc);
  }

  int pct = infusedPct();
  if (pct != cachePct) {
    cachePct = pct;
    String line = (totalPlanMl > 0)
      ? ("INFUSED " + String((int)totalVolumeMl) + "/" + String((int)totalPlanMl) + " mL")
      : ("INFUSED " + String((int)totalVolumeMl) + " mL");
    textAt(padTo(line, 22), 12, 272, 1, UI_DIM, THEME_BG);
    textRight(padTo(pct >= 0 ? (String(pct) + "%") : String("--"), 4), 164, 272, 1, COLOR_WHITE, THEME_BG);
    drawProgressBar(12, 286, 148, 12, (pct < 0) ? 0 : pct,
                    (uiAlertCode == ALERT_NEAR_END) ? COLOR_ORANGE : THEME_CYAN);
  }
}

// ============================================================================
// หน้า 2: PLAN — แผนการให้สารน้ำและเวลา (ตัวเลขใหญ่ 4 ค่า)
// ============================================================================
void drawStatCard(int y, const char* label, const String &value, uint16_t valueColor, bool labelOnly) {
  if (labelOnly) {
    tft.fillRoundRect(6, y, 160, 46, 6, UI_CARD);
    textAt(String(label), 14, y + 7, 1, UI_DIM, UI_CARD);
    return;
  }
  tft.fillRect(60, y + 18, 100, 26, UI_CARD);
  textRight(value, 158, y + 20, 3, valueColor, UI_CARD);
}

void drawPage2Framework() {
  tft.fillScreen(THEME_BG);
  drawTopBar(true);
  drawStatCard(30,  "TARGET   mL/h", "", 0, true);
  drawStatCard(84,  "PLAN   mL",     "", 0, true);
  drawStatCard(138, "INFUSED   mL",  "", 0, true);
  drawStatCard(192, "FINISH AT",     "", 0, true);
  drawPageDots(1, 308);
  cacheP2a = ""; cacheP2b = ""; cacheP2c = ""; cacheP2d = ""; cacheP2foot = "";
  stateNeedsRedraw = false;
}

