kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Station-V_7_5_3/ESP32-S3-Station-V_7_5_3.ino
  pinMode(BUZZER_PIN, OUTPUT); noTone(BUZZER_PIN);
  pinMode(TFT_BLK, OUTPUT); digitalWrite(TFT_BLK, HIGH);
  pinMode(BTN_PIN, INPUT_PULLUP);
  pinMode(SENSOR_AO_PIN, INPUT);

  analogReadResolution(12);
  analogSetAttenuation(ADC_11db);
  resetSignalChain(readSensorAverage(16));

  SPI_TFT.begin(TFT_SCLK, -1, TFT_MOSI, TFT_CS);
  tft.init(172, 320);
  tft.setSPISpeed(40000000);
  tft.setRotation(TFT_ROTATION_DEFAULT);
  tft.setTextWrap(false);

  stationPrefs.begin("st_cfg", false);
  currentStationId = stationPrefs.getUChar("id", 1);
  savedChannel     = stationPrefs.getUChar("ch", DEFAULT_ESPNOW_CHANNEL);
  uint8_t savedRot = stationPrefs.getUChar("rot", TFT_ROTATION_DEFAULT);
  stationPrefs.end();
  applyScreenRotation(savedRot);   // ทิศจอที่เคยตั้งไว้ที่หน้าเครื่อง
  if (currentStationId < 1 || currentStationId > 8) currentStationId = 1;

  // ---- กันสเตชันหลายตัวส่งชนกัน ----
  // เมล็ดสุ่มมาจาก MAC (ไม่ซ้ำกันทุกบอร์ด) และรอบแรกเหลื่อมกันตามเลขเตียง
  // ทำให้แพ็กเก็ตของแต่ละเตียงกระจายกันทั้งวินาทีตั้งแต่บูต ไม่ต้องรอให้ jitter ค่อย ๆ แยก
  {
    uint8_t mac[6] = {0};
    WiFi.macAddress(mac);
    randomSeed(((uint32_t)mac[5] << 16) ^ ((uint32_t)mac[4] << 8) ^ (uint32_t)mac[3]
               ^ ((uint32_t)currentStationId << 24) ^ (uint32_t)micros());
    lastSendTime  = millis();
    nextSendDelay = (unsigned long)currentStationId * (SEND_INTERVAL_MS / 9);
  }
  if (savedChannel < 1 || savedChannel > MAX_WIFI_CHANNEL) savedChannel = DEFAULT_ESPNOW_CHANNEL;

  stationPrefs.begin("st_cal", true);
  dropPolarity     = (int8_t)stationPrefs.getInt("pol", -1);
  dropTriggerDelta = stationPrefs.getInt("trig",  CAL_DEFAULT_TRIGGER);
  dropReleaseDelta = stationPrefs.getInt("rel",   CAL_DEFAULT_TRIGGER * 2 / 5);
  calDropAmp       = stationPrefs.getInt("amp",   0);
  calNoisePp       = stationPrefs.getInt("noise", 0);
  calSnrX10        = stationPrefs.getUChar("snr", 0);
  calQuality       = stationPrefs.getUChar("q",   0);
  learnAmp         = stationPrefs.getInt("lamp",  0);
  learnWidth       = stationPrefs.getInt("lwid",  0);
  stationPrefs.end();
  if (learnWidth < DROP_MIN_WIDTH_MS || learnWidth > DROP_MAX_WIDTH_MS) learnWidth = 0;
  if (learnAmp < 0) learnAmp = 0;
  if (dropPolarity != 1) dropPolarity = -1;
  if (dropTriggerDelta < CAL_MIN_TRIGGER) dropTriggerDelta = CAL_DEFAULT_TRIGGER;
  if (dropReleaseDelta < 2 || dropReleaseDelta >= dropTriggerDelta)
    dropReleaseDelta = dropTriggerDelta * 2 / 5;

  setLedColor(0, 40, 80);
  resetTrendData();
  trendLastSample = millis();

  tft.fillScreen(THEME_BG);
  drawCenteredString("SMART IV", 60, 3, THEME_SKYBLUE, THEME_BG);
  drawCenteredString("ALERT", 92, 2, THEME_PINK, THEME_BG);

  char bedBuf[12];
  snprintf(bedBuf, sizeof(bedBuf), "BED %02d", currentStationId);
  tft.fillRoundRect(26, 140, 120, 48, 8, THEME_SKYBLUE);
  drawCenteredString(String(bedBuf), 154, 3, THEME_BG, THEME_SKYBLUE);

  drawCenteredString("Bed Station Node", 214, 1, UI_DIM, THEME_BG);
  drawCenteredString("FW v" APP_VERSION, 232, 1, THEME_SKYBLUE, THEME_BG);
  drawCenteredString("BCN Phrae Innovation", 256, 1, UI_DIM, THEME_BG);

  playWelcomeMelody();
  delay(600);

  WiFi.mode(WIFI_STA);
  WiFi.disconnect();
  WiFi.setSleep(false);
  setEspNowChannel(savedChannel);

  if (esp_now_init() != ESP_OK) {
    drawCenteredString("ESP-NOW INIT FAILED", 270, 1, COLOR_RED, THEME_BG);
    Serial.println("[STATION] ESP-NOW init FAILED");
  } else {
    esp_now_register_recv_cb(esp_now_recv_cb_t(OnTimeSyncRecv));

    esp_now_peer_info_t peerInfo = {};
    memcpy(peerInfo.peer_addr, broadcastAddress, 6);
    peerInfo.channel = 0;              // 0 = ใช้ช่องปัจจุบัน (รองรับการเปลี่ยนช่องระหว่างค้นหา Host)
    peerInfo.ifidx = WIFI_IF_STA;
    peerInfo.encrypt = false;
    esp_now_add_peer(&peerInfo);
  }

  currentState = STATE_NORMAL_VIEW;
  currentNursePage = 1;
  stateNeedsRedraw = true;
  lastUserActivityTime = millis();
  lastChannelHopTime = millis();
}

// ----------------------------------------------------------------------------
// Loop
// ----------------------------------------------------------------------------
void loop() {
  serviceDropSensor(isRunning);   // อ่านเซนเซอร์/เดินเครื่องจักรสถานะ (ไม่นับหยดตอนหยุดชั่วคราว)
  handleButton();

  unsigned long currentMillis = millis();

  if (pendingCounterReset) applyCounterReset();

  // ตรวจสอบการเชื่อมต่อกับ Host หากเกิน 5 วินาทีให้ถือว่าหลุด
  unsigned long lr = lastHostRecvTime;
  if (lr == 0 || (currentMillis > lr && currentMillis - lr > HOST_TIMEOUT_MS)) {
    isHostOnline = false;
  }
  manageChannelHunting(currentMillis);

  // สายพับ -> อัตราไหลเป็น 0
  if (isLocallyOccluded() && currentFlowRate_ml_hr != 0.0f) {
    currentFlowRate_ml_hr = 0.0f;
    currentGttMin = 0.0f;
  }
  totalVolumeMl = (float)totalDrops / (float)safeDropFactor(dropFactor);

  uint8_t alertCode = effectiveAlertCode();
  uiAlertCode = alertCode;                                // ให้ทุกหน้าจอใช้รหัสเดียวกัน
  updateTrendAccumulator(currentMillis);                  // เก็บข้อมูลกราฟตลอดเวลา
  if (!isCriticalAlert(alertCode)) snoozeUntilTime = 0;   // เหตุการณ์หายไปแล้ว ยกเลิก snooze
  handlePassiveBuzzerEngine(alertCode);
  updateStatusLed(alertCode);

  // ---- ส่งข้อมูลให้ Host ทุก 1 วินาที (ส่งแม้อยู่ในหน้าตั้งค่า) ----
  if (currentMillis - lastSendTime >= nextSendDelay) {
    myData.stationId       = currentStationId;
    myData.isRunning       = isRunning ? 1 : 0;
    myData.totalDrops      = totalDrops;
    myData.periodDrops     = periodDropsCounter;
    myData.flowRateHr      = isRunning ? currentFlowRate_ml_hr : 0.0f;
    myData.msSinceLastDrop = hasFirstDropOccurred ? (uint32_t)(currentMillis - lastDropTimestamp) : 0;
    if (myData.msSinceLastDrop == 0 && hasFirstDropOccurred) myData.msSinceLastDrop = 1;
    myData.batteryVolts    = readStationBattery();
    myData.flags           = nearEndAckRequest ? 0x01 : 0x00;

    if (esp_now_send(broadcastAddress, (uint8_t *)&myData, sizeof(myData)) == ESP_OK) {
      periodDropsCounter = 0;
    }
    lastSendTime = currentMillis;
    // สุ่มคาบถัดไปใหม่เสมอ สองสเตชันที่บังเอิญส่งพร้อมกันจึงแยกจากกันในรอบถัดไปทันที
    nextSendDelay = (unsigned long)(SEND_INTERVAL_MS - SEND_JITTER_MS)
                  + (unsigned long)random(0, 2 * SEND_JITTER_MS + 1);
  }

  if (currentState == STATE_CONFIG_ID) {
    if (stateNeedsRedraw) drawStationIdConfigFramework();
    updateStationIdConfigDynamic();

