kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Station-V_7_5_3/ESP32-S3-Station-V_7_5_3.ino
    if (currentMillis >= configAutoSaveTimeout) {
      if (tempConfigStationId != currentStationId) {
        currentStationId = tempConfigStationId;
        stationPrefs.begin("st_cfg", false);
        stationPrefs.putUChar("id", currentStationId);
        stationPrefs.end();
        // ล้างค่าของเตียงเดิม รอค่าของเตียงใหม่จาก Host
        targetRateHr = 0;
        totalPlanMl = 0;
        hostAlertCode = ALERT_NONE;
        knownResetSeq = -1;
      }
      soundStart();
      currentState = STATE_NORMAL_VIEW;
      stateNeedsRedraw = true;
    }
    return;
  }

  // ---- จัดการสถานะเตือน ----
  bool critical = isCriticalAlert(alertCode);
  if (critical && currentMillis >= snoozeUntilTime) {
    if (currentState != STATE_EMERGENCY && !isHoldUiActive) {
      currentState = STATE_EMERGENCY;
      stateNeedsRedraw = true;
    } else if (currentState == STATE_EMERGENCY && alertCode != lastEmergencyCode) {
      stateNeedsRedraw = true;
    }
  } else if (currentState == STATE_EMERGENCY) {
    currentState = STATE_NORMAL_VIEW;
    stateNeedsRedraw = true;
  }

  // ---- เตือนใกล้หมด (ไม่ใช่เหตุวิกฤต) ----
  if (!critical && isNearEndPending(alertCode) && !isHoldUiActive &&
      (currentState == STATE_NORMAL_VIEW || currentState == STATE_SCREENSAVER)) {
    currentState = STATE_NEAR_END_NOTICE;
    stateNeedsRedraw = true;
  } else if (currentState == STATE_NEAR_END_NOTICE && (critical || !isNearEndPending(alertCode))) {
    currentState = critical ? STATE_EMERGENCY : STATE_NORMAL_VIEW;
    stateNeedsRedraw = true;
  }

  // ---- Screensaver เมื่อไม่มีการใช้งาน ----
  if (currentState == STATE_NORMAL_VIEW && !isHoldUiActive &&
      currentMillis - lastUserActivityTime >= SCREENSAVER_IDLE_MS) {
    currentState = STATE_SCREENSAVER;
    stateNeedsRedraw = true;
  }

  if (!isHoldUiActive) {
    if (currentState == STATE_EMERGENCY) {
      if (stateNeedsRedraw) { drawEmergencyScreen(alertCode); updateEmergencyDynamic(); }
    }
    else if (currentState == STATE_NORMAL_VIEW) {
      if (currentNursePage == 1) {
        if (stateNeedsRedraw) { drawPage1Framework(); updatePage1Dynamic(); }
        updateDripAnimation();
      } else if (currentNursePage == 2) {
        if (stateNeedsRedraw) { drawPage2Framework(); updatePage2Dynamic(); }
      } else if (currentNursePage == 3) {
        if (stateNeedsRedraw) { drawPage3Framework(); updatePage3Dynamic(); }
      } else if (currentNursePage == 4) {
        if (stateNeedsRedraw) { drawPage4Framework(); updatePage4Dynamic(); }
      }
    }
    else if (currentState == STATE_SCREENSAVER) {
      if (stateNeedsRedraw) { drawScreensaverFramework(); updateScreensaverDynamic(); }
    }
    else if (currentState == STATE_NEAR_END_NOTICE) {
      if (stateNeedsRedraw) { drawNearEndNoticeFramework(); updateNearEndNoticeDynamic(); }
    }
    else if (currentState == STATE_CREDIT) {
      if (stateNeedsRedraw) drawDeveloperCreditScreen();
    }
  }

  static unsigned long lastDynamicUpdate = 0;
  if (currentMillis - lastDynamicUpdate >= 1000) {
    lastDynamicUpdate = currentMillis;

    if (!isHoldUiActive) {
      if (currentState == STATE_NORMAL_VIEW) {
        if (currentNursePage == 1) updatePage1Dynamic();
        else if (currentNursePage == 2) updatePage2Dynamic();
        else if (currentNursePage == 3) updatePage3Dynamic();
        else if (currentNursePage == 4) updatePage4Dynamic();
      } else if (currentState == STATE_SCREENSAVER) {
        updateScreensaverDynamic();
      } else if (currentState == STATE_EMERGENCY) {
        updateEmergencyDynamic();
      } else if (currentState == STATE_NEAR_END_NOTICE) {
        updateNearEndNoticeDynamic();
      }
    }
  }
}
